public class Main {
    public static int main(String[] args) {
        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной милли
        int price = 1000; // цена одного билета
        int rubles = 20; // Сумма для начисления бонуса

        // Рассчитываете количество бонусных милль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран

        return price / rubles;
    }
}

